Revit 2026 API
GBXMLExportOptions Class
 Green Building XML Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GBXMLExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class GBXMLExportOptions : IDisposable
Public Class GBXMLExportOptions
	Implements IDisposable
public ref class GBXMLExportOptions : IDisposable
type GBXMLExportOptions =
    class
        interface IDisposable
    end
The GBXMLExportOptions type exposes the following members.
Constructors
Name | Description
GBXMLExportOptions |  Constructs a new instance of the options used to export a model in gbXML (Green Building XML) format.
Top
Properties
Name | Description
Encoding | Obsolete.
 The encoding options to go into the processing instruction for the exported gbXML file.
ExportAnalyticalSystems | Obsolete.
 Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
ExportEnergyModelType | Obsolete.
 The energy model type from which gbXML will be exported.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the GBXMLExportOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace